## Contents
### Part 1
#### Importing Libraries & Dataframes
#### Data Wrangling
#### Data quality and consistency check
#### Merging Dataframes
#### Exporting dataframes

## Step 3: Importing Libraries & Dataframes

### Importing Libraries

In [1]:
# Import libraries

import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

### Importing Dataframes

In [2]:
# Create path

path = r'C:\Users\aleen\OneDrive\Desktop\Aleena\CF assignments\Data Immersion\Achievement 4\23-04-2023 Instacart Basket Analysis'

In [4]:
# Import customers.csv as df_customers

df_customers = pd.read_csv(os.path.join(path, '02 Data', 'Original Data','customers.csv'), index_col = False)

In [5]:
# Import orders_products_updated.pkl as ords_prods_merge

ords_prods_merge = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_updated.pkl'))

## Step 4: Data Wrangling

In [6]:
# Check the dimensions of df_customers

df_customers.shape

(206209, 10)

In [7]:
# Check the column names of df_customers

df_customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [8]:
# Rename column: Surnam to Last Name

df_customers.rename(columns = {'Surnam': 'Last Name'}, inplace = True)

In [9]:
# Rename column: n_dependants to Number of Dependants

df_customers.rename(columns = {'n_dependants': 'Number of Dependants'}, inplace = True)

In [10]:
# Rename column: fam_status to Marital Status

df_customers.rename(columns = {'fam_status': 'Marital Status'}, inplace = True)

In [12]:
# Check the output

df_customers.head()

,user_id,First Name,Last Name,Gender,STATE,Age,date_joined,Number of Dependants,Marital Status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

###### No column requires dropping at this stage.

## Step 5: Data Quality & Consistency Checks

#### Checking for Data Types

In [13]:
# Check data types

df_customers.dtypes

user_id                  int64
First Name              object
Last Name               object
Gender                  object
STATE                   object
Age                      int64
date_joined             object
Number of Dependants     int64
Marital Status          object
income                   int64
dtype: object

##### No mixed data type found.

#### Checking for Missing Values

In [14]:
# Check for missing values

df_customers.isnull().sum()

user_id                     0
First Name              11259
Last Name                   0
Gender                      0
STATE                       0
Age                         0
date_joined                 0
Number of Dependants        0
Marital Status              0
income                      0
dtype: int64

In [15]:
# Adressing missing values

df_customers_nan = df_customers[df_customers['First Name'].isnull() == True]

In [17]:
df_customers_nan

,user_id,First Name,Last Name,Gender,STATE,Age,date_joined,Number of Dependants,Marital Status,income
53,76659,NaN,Gilbert,Male,Colorado,26,1/1/2017,2,married,41709
73,13738,NaN,Frost,Female,Louisiana,39,1/1/2017,0,single,82518
82,89996,NaN,Dawson,Female,Oregon,52,1/1/2017,3,married,117099
99,96166,NaN,Oconnor,Male,Oklahoma,51,1/1/2017,1,married,155673
105,29778,NaN,Dawson,Female,Utah,63,1/1/2017,3,married,151819
...,...,...,...,...,...,...,...,...,...,...
206038,121317,NaN,Melton,Male,Pennsylvania,28,3/31/2020,3,married,87783
206044,200799,NaN,Copeland,Female,Hawaii,52,4/1/2020,2,married,108488
206090,167394,NaN,Frost,Female,Hawaii,61,4/1/2020,1,married,45275
206162,187532,NaN,Floyd,Female,California,39,4/1/2020,0,single,56325
206171,116898,NaN,Delgado,Female,Colorado,23,4/1/2020,2,married,59222

###### 11259 entries have not provided their First Name but other data is present so these rows can not be deleted.

#### Checking for Duplicates

In [18]:
# Check for duplicates 

df_dups = df_customers[df_customers.duplicated()]

In [19]:
df_dups.shape

(0, 10)

###### No duplicates found in the dataframe

## Step 6: Merge Dataframes

In [20]:
# Check the dimensions of ords_prods_merge

ords_prods_merge.shape

(32404859, 24)

In [21]:
# Check data types

ords_prods_merge.dtypes

order_id                     int64
user_id                      int64
order_number                 int64
orders_day_of_week           int64
order_hour_of_day            int64
days_since_prior_order     float64
product_id                   int64
add_to_cart_order            int64
reordered                    int64
product_name                object
aisle_id                     int64
department_id                int64
prices                     float64
_merge                    category
price_range_loc             object
busiest_day                 object
busiest_days                object
busiest_period_of_day       object
max_order                    int64
loyalty_flag                object
avg_price                  float64
spending_flag               object
median_frequency           float64
order_frequency_flag        object
dtype: object

In [23]:
# Merging clean dataframes based on the user_id column as key

df_merged = ords_prods_merge.merge(df_customers, on = 'user_id')

In [24]:
# Check the output

df_merged.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,...,order_frequency_flag,First Name,Last Name,Gender,STATE,Age,date_joined,Number of Dependants,Marital Status,income
0,2539329,1,1,2,8,NaN,196,1,0,Soda,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
1,2398795,1,2,3,7,15.0,196,1,1,Soda,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
2,473747,1,3,3,12,21.0,196,1,1,Soda,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
3,2254736,1,4,4,7,29.0,196,1,1,Soda,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
4,431534,1,5,4,15,28.0,196,1,1,Soda,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423

## Step 8: Exporting Dataframes

In [25]:
df_merged.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'merged_data.pkl'))